import { Router } from "express";
const router = Router();

router.get("/prayer", (req, res) => {
  res.render("pages/prayer", {
    options: {
      title: `أوقات الصلاة الدقيقة, تتبع صلواتك اليومية`,
      keywords: [
        "أوقات الصلاة",
        "الصلاة الإسلامية",
        "التنبيهات الصوتية للصلاة",
        "جدول الصلاة",
        "وقت صلاة الفجر",
        "وقت صلاة الظهر",
        "وقت صلاة العصر",
        "وقت صلاة المغرب",
        "وقت صلاة العشاء",
        "التقوى",
        "الإيمان",
      ],
      description:
        "تعد هذه الصفحة أداة رائعة لأولئك الذين يرغبون في ضمان أداء صلواتهم الخمس (الفجر، الظهر، العصر، المغرب، العشاء) في الوقت المحدد كل يوم, بناءً على موقع المستخدم. يتم تحديث هذه الأوقات يوميًا لضمان دقتها.",
    },
  });
});

router.get("/input-location", (req, res) => {
  res.render("pages/input_location", {
    options: {
      title: "إدخال الموقع يدوياً لتحديد أوقات الصلاة",
      keywords: [
        "إدخال الموقع",
        "تحديد الموقع",
        "أوقات الصلاة",
        "الصلاة الإسلامية",
        "التنبيهات الصوتية للصلاة",
        "جدول الصلاة",
        "وقت صلاة الفجر",
        "وقت صلاة الظهر",
        "وقت صلاة العصر",
        "وقت صلاة المغرب",
        "وقت صلاة العشاء",
        "التقوى",
        "الإيمان",
      ],
      description:
        "تتيح هذه الصفحة إدخال الموقع يدوياً (خط العرض وخط الطول) لتحديد أوقات الصلاة بدقة بناءً على موقع المستخدم. يمكن اختيار طريقة حساب الأوقات والمذهب الفقهي.",
    },
  });
});


export default router;
