
export default async (router) => {
  router.get("/prayer", (req, res) => {
    res.render("pages/prayer", {
      options: {
        title: `أوقات الصلاة الدقيقة, تتبع صلواتك اليومية`,
        keywords: ["أوقات الصلاة", "الصلاة الإسلامية", "التنبيهات الصوتية للصلاة", "جدول الصلاة", "وقت صلاة الفجر", "وقت صلاة الظهر", "وقت صلاة العصر", "وقت صلاة المغرب", "وقت صلاة العشاء", "التقوى", "الإيمان"],
        description: "تعد هذه الصفحة أداة رائعة لأولئك الذين يرغبون في ضمان أداء صلواتهم الخمس (الفجر، الظهر، العصر، المغرب، العشاء) في الوقت المحدد كل يوم, بناءً على موقع المستخدم. يتم تحديث هذه الأوقات يوميًا لضمان دقتها.",
      },
    });
  });
};
